<?php

                                function convert_number($number) 
                                { 
                                    $my_number = $number;

                                    if (($number < 0) || ($number > 999999999)) 
                                    { 
                                        throw new Exception("Number is out of range");
                                    } 
                                    $Kt = floor($number / 10000000); /* Koti */
                                    $number -= $Kt * 10000000;
                                    $Gn = floor($number / 100000);  /* lakh  */ 
                                    $number -= $Gn * 100000; 
                                    $kn = floor($number / 1000);     /* Thousands (kilo) */ 
                                    $number -= $kn * 1000; 
                                    $Hn = floor($number / 100);      /* Hundreds (hecto) */ 
                                    $number -= $Hn * 100; 
                                    $Dn = floor($number / 10);       /* Tens (deca) */ 
                                    $n = $number % 10;               /* Ones */ 

                                    $res = ""; 

                                    if ($Kt) 
                                    { 
                                        $res .= convert_number($Kt) . " কোটি "; 
                                    } 
                                    if ($Gn) 
                                    { 
                                        $res .= convert_number($Gn) . " লাখ"; 
                                    } 

                                    if ($kn) 
                                    { 
                                        $res .= (empty($res) ? "" : " ") . 
                                        convert_number($kn) . " হাজার"; 
                                    } 

                                    if ($Hn) 
                                    { 
                                        $res .= (empty($res) ? "" : " ") . 
                                        convert_number($Hn) . " শত"; 
                                    } 

                                    $ones = array("", "এক", "দুই", "তিন", "চার", "পাচ", "ছয়", 
                                        "সাত", "আট", "নয়", "দশ", "েগার", "বার", "তের", 
                                        "চৌদ্দ", "পনের", "ষোল", "সতের", "আঠারো", 
                                        "উনিশ","বিশ","একুশ","বাইশ","তেইশ","চব্বিশ","পচিশ","ছাব্বিশ","সাতাশ","আঠাস","ঊনত্রিশ","ত্রিশ","একত্রিশ","বত্রিশ","তেত্রিশ","চৌত্রিশ","পঁয়ত্রিশ","ছত্রিশ","সাতত্রিশ","আটত্রিশ","ঊনচল্লিশ","চল্লিশ","একচল্লিশ","বেয়াল্লিশ","তেতাল্লিশ","চুয়াল্লিশ","পঁয়তাল্লিশ","ছেচল্লিশ","সাতচল্লিশ","আটচল্লিশ","ঊনপঞ্চাশ","পঞ্চাশ","একান্ন","বায়ান্ন","তেপ্পান্ন","চুয়ান্ন","পঞ্চান্ন","ছাপ্পান্ন","সাতান্ন","আটান্ন","ঊনষ্ট","ষাট","একষট্টি","বাষট্টি","তেষট্টি","চৌষট্টি","পয়ষট্টি","ছেষট্টি","সাতষট্টি","আটষট্টি","ঊনসত্তর","সত্তর","একত্তর","বাহাত্তর","তেহাত্তর","চুহাত্তর","পঁচাত্তর","ছিয়াত্তর","সাতাত্তর","আটাত্তর","ঊন আশি","আশি","একাশি","বিরাশি","তেরাশি","চুরাশি","পঁচাশি","ছেয়াশি","সাতাশি","আটাশি","ঊননব্বই","নব্বই","একানব্বই","বিরানব্বই","তিরানব্বই","চুরানব্বই","পচানব্বই","ছিয়াননব্বই","সাতানব্বই","আটানব্বই","নিরানব্বই"); 
                                    $tens = array("", "", "বিশ", "ত্রিশ", "চল্লিশ", "প্নচাশ", "ষাট", 
                                        "সত্তর", "আশি", "নব্বই"); 

                                    if ($Dn || $n) 
                                    { 
                                        if (!empty($res)) 
                                        { 
                                            $res .= "  "; 
                                        }
                                        $res .= $ones[$Dn * 10 + $n]; 
                                    }  

                                    if (empty($res)) 
                                    { 
                                        $res = "শূণ্য"; 
                                    } 

                                    return $res; 


                                } 



                                ?> 